04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/CHT/engine2Valve2D/constant/piston/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/piston";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType  constSolidThermo;

rho
{
    type        uniform;
    value       89.40; // div by 10
}

Cv
{
    type        uniform;
    value       385;
}

kappa
{
    type        uniform;
    value       380;
}

// ************************************************************************* //
